In [2]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine

In [209]:
engine = create_engine('sqlite:///../data/raw/JulenC.db')

In [210]:
df_business = pd.read_sql_table('business_info', engine)

In [211]:
df_personal = pd.read_sql_table('personal_info', engine)

In [212]:
df_rank = pd.read_sql_table('rank_info', engine)

In [213]:
df_business.head()

,id,Unnamed: 0,Source,worth,worthChange,realTimeWorth,realTimePosition
0,3033,52,Technology ==> Amazon,112.0 BUSD,0.0 millions USD,NaN,1
1,3381,53,Technology ==> Microsoft,90.0 BUSD,-0.001 millions USD,NaN,2
2,2949,54,Finance and Investments ==> Berkshire Hathaway,84.0 BUSD,-0.002 millions USD,NaN,3
3,7380,55,Fashion & Retail ==> LVMH,72.0 BUSD,0.0 millions USD,NaN,4
4,6568,56,Technology ==> Facebook,71.0 BUSD,0.0 millions USD,NaN,5

In [214]:
df_business.sort_values("realTimePosition")

,id,Unnamed: 0,Source,worth,worthChange,realTimeWorth,realTimePosition
0,3033,52,Technology ==> Amazon,112.0 BUSD,0.0 millions USD,NaN,1
1,3381,53,Technology ==> Microsoft,90.0 BUSD,-0.001 millions USD,NaN,2
2,2949,54,Finance and Investments ==> Berkshire Hathaway,84.0 BUSD,-0.002 millions USD,NaN,3
3,7380,55,Fashion & Retail ==> LVMH,72.0 BUSD,0.0 millions USD,NaN,4
4,6568,56,Technology ==> Facebook,71.0 BUSD,0.0 millions USD,NaN,5
...,...,...,...,...,...,...,...
2155,4524,2207,Technology ==> mobile gaming,1.0 BUSD,nan millions USD,NaN,2151
2154,5983,2206,Manufacturing ==> antennas,1.0 BUSD,nan millions USD,NaN,2151
2136,3259,2188,Technology ==> Stripe,1.0 BUSD,0.0 millions USD,NaN,2152
2133,2855,2185,Metals & Mining ==> metallurgy,1.0 BUSD,nan millions USD,NaN,2153
2132,7381,2184,Fashion & Retail ==> Patagonia,1.0 BUSD,0.0 millions USD,NaN,2153

In [215]:
df_rank.head()

     id                         name  position  Unnamed: 0
0  9141  anant ASAVABHOKHIN & FAmily       NaN           0
1  3602               araSH FERDOWSI       NaN           1
2  1750     banthoon laMSAM & FAMIly       NaN           2
3  5586       bill adderlEY & family       NaN           3
4  3870            boris ZINGAREVIch       NaN           4

In [216]:
df = df_business.merge(df_rank, on = ['id', 'Unnamed: 0'], how = 'left')

In [217]:
df = df.merge(df_personal, on = ['id', 'Unnamed: 0'], how = 'outer')

In [218]:
df.drop(['Unnamed: 0', 'lastName'], axis = 1, inplace = True)

In [219]:
df.name = df.name.str.title()

In [220]:
df.position = df.position.astype("int64")

In [221]:
df.worth = df.worth.str.replace('BUSD', '').astype('float64')

In [234]:
newcol = list(df.columns)
newcol[2] = "worth (BUSD)"
df.columns = newcol

In [223]:
df.age = df.age.str.replace(" years old", "")

In [224]:
df.age = df.age.fillna(value = np.nan).astype("float64")

In [225]:
df.age = df.age.apply(lambda x: 2019 - x if x > 1900 else x)

In [235]:
df.head()

,id,Source,worth (BUSD),worthChange,realTimeWorth,realTimePosition,name,position,age,gender,country,image
0,3033,Technology ==> Amazon,112.0,0.0 millions USD,NaN,1,Jeff Bezos,1,54.0,M,United States,https://specials-images.forbesimg.com/imageser...
1,3381,Technology ==> Microsoft,90.0,-0.001 millions USD,NaN,2,Bill Gates,2,62.0,M,United States,https://specials-images.forbesimg.com/imageser...
2,2949,Finance and Investments ==> Berkshire Hathaway,84.0,-0.002 millions USD,NaN,3,Warren Buffett,3,87.0,M,United States,https://specials-images.forbesimg.com/imageser...
3,7380,Fashion & Retail ==> LVMH,72.0,0.0 millions USD,NaN,4,Bernard Arnault,4,69.0,None,None,https://specials-images.forbesimg.com/imageser...
4,6568,Technology ==> Facebook,71.0,0.0 millions USD,NaN,5,Mark Zuckerberg,5,34.0,None,None,https://specials-images.forbesimg.com/imageser...

In [232]:
#Separar source.

Series([], Name: country, dtype: object)